Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Centralized Soft Reset (PUBLIC FUNCTION)                                  */
/* -------------------------------------------------------------------------- */
void GCODE_SoftReset(APP_DATA* appData, GCODE_CommandQueue* cmdQueue)
{
    if (appData == NULL || cmdQueue == NULL) {
        return;
    }

    DEBUG_PRINT_GCODE("[SOFT RESET] Software reset - clearing buffers and state\r\n");

    /* 0. Detect alarm condition BEFORE stopping (state changes immediately after) */
    uint8_t soft_reset_alarm = 0;
    if (HOMING_IsActive()) {
        soft_reset_alarm = 6;   // ALARM:6 — homing fail, reset during homing
    } else if (INTERPOLATOR_IsActive()) {
        soft_reset_alarm = 3;   // ALARM:3 — reset while in motion (abort cycle)
    }

    /* 1. Stop all motion immediately */
    STEPPER_StopMotion();  // Disables steppers, stops TMR4, disables OC1
    HOMING_Abort();        // Abort homing if in progress
    
    /* 2. Re-initialize stepper module (clears Bresenham state, direction bits, etc.) */
    // This fixes the X-axis selective disable issue after soft reset
    STEPPER_Initialize(appData);
    
    /* 3. Flush UART RX buffer to avoid processing pre-reset commands */
    uint8_t scratch[64];
    uint32_t rc;
    while ((rc = UART3_ReadCountGet()) > 0U) {
        uint32_t toRead = (rc > sizeof(scratch)) ? (uint32_t)sizeof(scratch) : rc;
        (void)UART3_Read(scratch, toRead);
    }
    

        /* 10. Clear RX buffer */
    nBytesRead = 0;
    memset(rxBuffer, 0, sizeof(rxBuffer));

    /* 3. Clear motion queue */
    memset(appData->motionQueue, 0, sizeof(appData->motionQueue));
    appData->motionQueueHead = 0;
    appData->motionQueueTail = 0;
    appData->motionQueueCount = 0;
    appData->currentSegment = NULL;
    appData->motionSegmentCompleted = false;
    
    /* 4. Clear arc generator state */
    appData->arcGenState = ARC_GEN_IDLE;
    
    /* 5. Reset modal state to GRBL defaults */
    appData->modalPlane = 0;        // G17 (XY plane)
    appData->absoluteMode = true;   // G90 (absolute mode)
    appData->modalFeedrate = 0.0f;  // F (no feedrate set)
    appData->modalSpindleRPM = 0;   // S (spindle off)
    appData->modalToolNumber = 0;   // T0
    
    /* 6. Clear alarm state */
    // Clear alarm but suppress hard limits until user moves off limit
    // This prevents immediate re-alarm after soft reset while on limit
    g_hard_limit_alarm = false;
    g_estop_pending = false;        // Just in case ESTOP was pending when soft limit was hit.
    g_suppress_hard_limits = true;  // Will auto-clear in IDLE when limits released
    appData->alarmCode = 0;
    grblAlarm = false;
    
    /* 7. Reset application state — ALARM if homing/motion was aborted, IDLE otherwise */
    if (soft_reset_alarm != 0) {
        UART_Printf("ALARM:%u\r\n", (unsigned)soft_reset_alarm);
        appData->state = APP_ALARM;
        appData->alarmCode = soft_reset_alarm;
    } else {
        appData->state = APP_IDLE;
    }
    
    /* 8. Clear G-code command queue */
    cmdQueue->head = 0;
    cmdQueue->tail = 0;
    cmdQueue->count = 0;
    cmdQueue->commands_consumed = 0;
    
    /* 9. Reset G-code parser state */
    okPendingCount = 0;         // Clear all deferred ok responses
    s_homing_pending = false;       // Clear homing sentinel
    s_homing_started = false;       // Clear homing-started flag
    s_rxHasPushback  = false;       // Clear any pending push-back byte
    grblCheckMode = false;
    g_feed_hold_active  = false;  // Clear hold (defined in stepper.c / stepper.h)
    g_feed_hold_pending = false;  // Cancel any in-flight pending hold
    unitsInches = false;
    

    gcodeData.state = GCODE_STATE_IDLE;
    
    /* 11. Send GRBL startup banner (UGS expects this after soft reset) */
    UART_SEND_BANNER();
    
    DEBUG_PRINT_GCODE("[SOFT RESET] Complete - ready for new commands\r\n");
}

/* -------------------------------------------------------------------------- */
/* USART Initialization                                                       */
/* -------------------------------------------------------------------------- */
void GCODE_USART_Initialize(uint32_t RD_thresholds)
{
    (void)RD_thresholds;
    UART_Initialize();
    
    /* Print GRBL startup banner (disable for custom firmware identification) */
#ifdef ENABLE_STARTUP_BANNER
    UART_SEND_BANNER();  // Compile-time string and length from common.h
#endif

    nBytesRead = 0;
    memset(rxBuffer, 0, sizeof(rxBuffer));
    okPendingCount = 0;       // Clear all deferred ok responses
    s_rxHasPushback = false;  // Clear any pending push-back byte
    gcodeData.state = GCODE_STATE_IDLE;
    unitsInches = false;
    grblCheckMode = false;
    grblAlarm = false;
    g_feed_hold_active  = false;
    g_feed_hold_pending = false;

    // ✅ REMOVED: Startup deferral initialization (no longer used)
}

/* -------------------------------------------------------------------------- */
/* Helper: queue command (assumes space available already checked)           */
/* -------------------------------------------------------------------------- */
static inline void queue_command(GCODE_CommandQueue* q, const char* src, size_t len){
    if (len == 0 || len >= GCODE_BUFFER_SIZE) return;
    if (q->count >= GCODE_MAX_COMMANDS) {
        // Flow control should prevent this — if it fires, the sender got an ok
        // before the command queue had a free slot, which means a command is
        // silently dropped.  Emit a UART error so it shows up in trace output.
        UART_Printf("error:20\r\n");  // error:20 = gcode queue overflow
        return;
    }
    memcpy(q->commands[q->head].command, src, len);
    q->commands[q->head].command[len] = '\0';
    q->head = (q->head + 1) % GCODE_MAX_COMMANDS;
    q->count++;
}

/* -------------------------------------------------------------------------- */
/* Helper: split combined modal tokens like "G21G90" or "G90G0Z5"             */
/* Rules:
 *  - Multiple G/M words may be concatenated.
 *  - Parameters belong to the final word only (e.g. G90G0X1 -> "G90", "G0X1")
 *  - Return number of pieces queued.
 * -------------------------------------------------------------------------- */
static uint32_t split_and_queue_multi_modal(GCODE_CommandQueue* q, char* token)
{
    uint32_t pieces = 0;
    size_t len = strlen(token);
    if (len < 3) { /* Too short to contain combined words */
        queue_command(q, token, len);
        return 1;
    }

    /* Collect positions of G/M designators */
    uint8_t pos[8];
    uint8_t posCount = 0;
    for (size_t i = 0; i < len && posCount < (sizeof(pos)/sizeof(pos[0])); i++){
        char c = token[i];
        if (c == 'G' || c == 'M'){
            pos[posCount++] = (uint8_t)i;
        }
    }

    if (posCount <= 1){
        queue_command(q, token, len);
        return 1;
    }

    /* For each modal except last, emit substring up to next modal start */
    for (uint8_t i = 0; i < posCount - 1; i++){
        uint8_t start = pos[i];
        uint8_t end   = pos[i+1];
        if (end > start){
            queue_command(q, &token[start], (size_t)(end - start));
            pieces++;
        }
    }
    /* Last piece: from last modal start to end of original token */
    queue_command(q, &token[pos[posCount-1]], len - pos[posCount-1]);
    pieces++;
    return pieces;
}

