Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Extract line and tokenize                                                  */
/* -------------------------------------------------------------------------- */
GCODE_CommandQueue* Extract_CommandLineFrom_Buffer(uint8_t* buffer, uint32_t length, GCODE_CommandQueue* commandQueue)
{
    GCODE_CommandQueue* cmdQueue = commandQueue;
    char line_buffer[256];
    uint32_t safe_length = (length < sizeof(line_buffer) - 1U) ? length : (sizeof(line_buffer) - 1U);
    memcpy(line_buffer, buffer, safe_length);
    line_buffer[safe_length] = '\0';

    for (uint32_t i = 0; i < safe_length; i++) {
        char c = line_buffer[i];
        if (c >= 'a' && c <= 'z') line_buffer[i] = (char)(c - 'a' + 'A');
    }

    uint32_t write_pos = 0;
    for (uint32_t read_pos = 0; read_pos < safe_length; read_pos++) {
        char c = line_buffer[read_pos];
        if ((c >= 32 && c <= 126) || c == '\r' || c == '\n' || c == '\t')
            line_buffer[write_pos++] = c;
    }
    line_buffer[write_pos] = '\0';
    safe_length = write_pos;

    TokenArray tokens;
    uint32_t token_count = UTILS_TokenizeGcodeLine(line_buffer, &tokens);

    for (uint32_t i = 0; i < token_count; i++) {
        if (UTILS_IsEmptyString(tokens.tokens[i]) || UTILS_IsComment(tokens.tokens[i])) continue;
        if (((cmdQueue->head + 1) % GCODE_MAX_COMMANDS) == cmdQueue->tail) break; /* queue full */

        /* Detect combined modal sequences (must start with G/M and contain another G/M) */
        bool combined = false;
        if (tokens.tokens[i][0] == 'G' || tokens.tokens[i][0] == 'M'){
            for (char* p = tokens.tokens[i] + 1; *p; ++p){
                if (*p == 'G' || *p == 'M'){
                    combined = true;
                    break;
                }
            }
        }

        if (combined){
            split_and_queue_multi_modal(cmdQueue, tokens.tokens[i]);
        } else {
            size_t tlen = UTILS_SafeStrlen(tokens.tokens[i], GCODE_BUFFER_SIZE - 1U);
            queue_command(cmdQueue, tokens.tokens[i], tlen);
        }
    }
    return cmdQueue;
}

/* -------------------------------------------------------------------------- */
/* Command -> Event Parser                                                    */
/* -------------------------------------------------------------------------- */
static bool parse_command_to_event(const char* cmd, GCODE_Event* ev)
{
    if (!cmd || !ev) return false;
    ev->type = GCODE_EVENT_NONE;

    // Axis letter array for scalable parsing (shared across all parsing blocks)
    static const char axis_letters[NUM_AXIS] = {'X', 'Y', 'Z', 'A'};

    DEBUG_PRINT_GCODE("[PARSE] cmd='%s'\r\n", cmd);

    if (cmd[0] == 'G') {
        char* pend = NULL;
        int gnum = (int)strtol(&cmd[1], &pend, 10);
        
        DEBUG_PRINT_GCODE("[PARSE] G-code detected: gnum=%d\r\n", gnum);

        // G20/G21 - Units (handled internally, no event needed)
        if (gnum == 20) { unitsInches = true;  ev->type = GCODE_EVENT_NONE; return true; }
        if (gnum == 21) { unitsInches = false; ev->type = GCODE_EVENT_NONE; return true; }

        // G98/G99 - Canned cycle return mode (modal, no event)
        if (gnum == 98) { s_canned_g98 = true;  ev->type = GCODE_EVENT_NONE; return true; }
        if (gnum == 99) { s_canned_g98 = false; ev->type = GCODE_EVENT_NONE; return true; }

        // G90/G91 - Positioning mode
        if (gnum == 90) { ev->type = GCODE_EVENT_SET_ABSOLUTE; return true; }
        if (gnum == 91) { ev->type = GCODE_EVENT_SET_RELATIVE; return true; }

        // Work coordinate system selection (G54-G59)
        if (gnum >= 54 && gnum <= 59) {
            ev->type = GCODE_EVENT_SET_WCS;
            ev->data.setWCS.wcs_number = gnum - 54;  // G54=0, G55=1, ..., G59=5
            return true;
        }

        // G92 - Set work coordinate offset (G10 L20 P0 semantics, active WCS).
        // Emitted as an event so the WCS offset is computed against the actual
        // machine position at this point in the motion stream — not at parse time.
        // The motion_bridge GCODE_EVENT_SET_WORK_OFFSET handler waits for motion
        // to drain before reading MPos, so a preceding G0 completes before G92
        // latches the offset.  This fixes the timing bug where G92 was executing
        // against the pre-move position when the sender pipelines G0 + G92.
        if (gnum == 92) {
            const float unit_scale = unitsInches ? 25.4f : 1.0f;
            ev->type = GCODE_EVENT_SET_WORK_OFFSET;
            ev->data.workOffset.l_value    = 92u;   // sentinel: G92 (distinct from G10 L20 which uses 20u)
            ev->data.workOffset.wcs_number = 255u;  // active WCS at event time
            ev->data.workOffset.x = NAN;
            ev->data.workOffset.y = NAN;
            ev->data.workOffset.z = NAN;
            ev->data.workOffset.a = NAN;
            for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                char* pAxis = find_char((char*)cmd, axis_letters[axis]);
                float v = pAxis ? (parse_float_after(pAxis) * unit_scale) : NAN;
                switch (axis) {
                    case AXIS_X: ev->data.workOffset.x = v; break;
                    case AXIS_Y: ev->data.workOffset.y = v; break;
                    case AXIS_Z: ev->data.workOffset.z = v; break;
                    case AXIS_A: ev->data.workOffset.a = v; break;
                    default: break;
                }
            }
            DEBUG_PRINT_GCODE("[PARSE] G92 -> WORK_OFFSET L20 P0 x=%.3f y=%.3f z=%.3f\r\n",
                (double)ev->data.workOffset.x, (double)ev->data.workOffset.y,
                (double)ev->data.workOffset.z);
            return true;
        }

        if (gnum == 10) {
            // G10 L2  Pn X# Y# Z# — set WCS offset directly (offset IS the value)
            // G10 L20 Pn X# Y# Z# — set WCS so current machine pos = given work pos
            // P0 = active WCS; P1–P6 = G54–G59 respectively
            char* pP = find_char((char*)cmd, 'P');
            char* pL = find_char((char*)cmd, 'L');
            int p_val = pP ? (int)strtol(pP + 1, NULL, 10) : 0;
            int l_val = pL ? (int)strtol(pL + 1, NULL, 10) : 0;
            if (l_val != 2 && l_val != 20) return true;  // Unsupported L — silently consume

            const float unit_scale = unitsInches ? 25.4f : 1.0f;
            ev->type = GCODE_EVENT_SET_WORK_OFFSET;
            ev->data.workOffset.l_value    = (uint32_t)l_val;
            // P0 → sentinel 255 = "resolve to active WCS at event-handle time"
            // P1–P6 → G54–G59 (wcs_number = p_val - 1)
            ev->data.workOffset.wcs_number = (p_val == 0) ? 255u
                : ((p_val >= 1 && p_val <= 6) ? (uint8_t)(p_val - 1) : 255u);

            ev->data.workOffset.x = NAN;
            ev->data.workOffset.y = NAN;
            ev->data.workOffset.z = NAN;
            ev->data.workOffset.a = NAN;
            for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                char* pAxis = find_char((char*)cmd, axis_letters[axis]);
                float v = pAxis ? (parse_float_after(pAxis) * unit_scale) : NAN;
                switch (axis) {
                    case AXIS_X: ev->data.workOffset.x = v; break;
                    case AXIS_Y: ev->data.workOffset.y = v; break;
                    case AXIS_Z: ev->data.workOffset.z = v; break;
                    case AXIS_A: ev->data.workOffset.a = v; break;
                    default: break;
                }
            }
            DEBUG_PRINT_GCODE("[PARSE] G10 L%d P%d wcs=%u x=%.3f y=%.3f z=%.3f\r\n",
                l_val, p_val, (unsigned)ev->data.workOffset.wcs_number,
                (double)ev->data.workOffset.x, (double)ev->data.workOffset.y,
                (double)ev->data.workOffset.z);
            return true;
        }

        // G38.2, G38.3, G38.4, G38.5 - Probe commands
        if (gnum == 38) {
            // Parse subcode after decimal point (e.g., G38.2 -> subcode = 2)
            char* pDot = find_char((char*)cmd, '.');
            if (pDot) {
                int subcode = (int)strtol(pDot + 1, NULL, 10);
                if (subcode >= 2 && subcode <= 5) {
                    // Determine probe direction and alarm behavior
                    if (subcode == 2 || subcode == 3) {
                        ev->type = GCODE_EVENT_PROBE_TOWARD;  // Probe toward workpiece
                        ev->data.probe.probe_toward = true;
                    } else {  // subcode == 4 || subcode == 5
                        ev->type = GCODE_EVENT_PROBE_AWAY;    // Probe away from workpiece
                        ev->data.probe.probe_toward = false;
                    }
                    
