Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
        /* Literal "0x18" typed by user */
        if (nBytesRead >= 4 &&
            rxBuffer[0] == '0' && rxBuffer[1] == 'x' &&
            rxBuffer[2] == '1' && rxBuffer[3] == '8') {
            GCODE_SoftReset(appData, cmdQueue);
            break;
        }

        if (is_control_char(rxBuffer[0])) {
            gcodeData.state = GCODE_STATE_CONTROL_CHAR;
        } else {
            bool has_terminator = false;
            uint32_t terminator_pos = 0;
            for (uint32_t i = 0; i < nBytesRead; i++) {
                if (rxBuffer[i] == '\n' || rxBuffer[i] == '\r') {
                    has_terminator = true;
                    terminator_pos = i;
                    break;
                }
            }
            if (!has_terminator) break;
            char saved_terminator = rxBuffer[terminator_pos]; // save for queue-full retry
            rxBuffer[terminator_pos] = '\0';

            // ✅ Check for control chars AFTER termination (handles '?' with newline)
            if (is_control_char(rxBuffer[0])) {
                gcodeData.state = GCODE_STATE_CONTROL_CHAR;
            } else if (rxBuffer[0] == '$') {
                gcodeData.state = GCODE_STATE_QUERY_CHARS;
            } else if (rxBuffer[0] == 'G' || rxBuffer[0] == 'g' ||
                       rxBuffer[0] == 'M' || rxBuffer[0] == 'm' ||
                       rxBuffer[0] == 'F' || rxBuffer[0] == 'f' ||
                       rxBuffer[0] == 'T' || rxBuffer[0] == 't' ||
                       rxBuffer[0] == 'S' || rxBuffer[0] == 's') {
                gcodeData.state = GCODE_STATE_GCODE_COMMAND;
            } else {
                // Determine if line contains G-code content (ignore pure comments / whitespace)
                bool has_content = false;
                // Find first non-whitespace character
                uint32_t first_idx = 0;
                while (first_idx < terminator_pos) {
                    char c = rxBuffer[first_idx];
                    if (c == ' ' || c == '\t') { first_idx++; continue; }
                    break;
                }
                if (first_idx < terminator_pos) {
                    char first = rxBuffer[first_idx];
                    if (first == ';' || first == '(') {
                        // Comment-only line → treat as blank, do not queue
                        has_content = false;
                    } else {
                        // Any other non-whitespace, non-comment first char counts as content
                        has_content = true;
                    }
                }
                if (has_content) {
                    DEBUG_PRINT_GCODE("[IDLE] Processing line: '%s'\r\n", rxBuffer);
                    uint32_t count_before_idle = cmdQueue->count;
                    cmdQueue = Extract_CommandLineFrom_Buffer(rxBuffer, terminator_pos, cmdQueue);
                    if (cmdQueue->count == count_before_idle) {
                        // Queue full — restore the line terminator so IDLE re-finds
                        // it on the next iteration and retries without losing the line.
                        rxBuffer[terminator_pos] = saved_terminator;
                        DEBUG_PRINT_GCODE("[IDLE] Queue full — retrying next iteration\r\n");
                        break;
                    }
                    // ✅ Send "ok" for all lines with content
                    DEBUG_PRINT_GCODE("[IDLE] Sending ok for content line\r\n");
                    SendOrDeferOk(appData, cmdQueue);
                } else {
                    // ✅ GRBL v1.1 behavior: Blank/comment lines get "ok" response.
                    // CRITICAL: blank/comment lines do NOT occupy a gcode queue slot
                    // (Extract_CommandLineFrom_Buffer is not called, q->count unchanged).
                    // Therefore we must NEVER defer their ok via SendOrDeferOk — doing
                    // so inflates okPendingCount independently of q->count.  When those
                    // phantom oks later burst-release they invite UGS to send commands
                    // that push q->count past GCODE_MAX_COMMANDS, silently dropping them.
                    // Pure arc tests hide this because they have almost no blank lines;
                    // mixed-content files (sections separated by comment blocks) expose it.
                    // Solution: always send ok immediately for blank/comment lines.
                    DEBUG_PRINT_GCODE("[IDLE] Blank/comment line - sending ok immediately (no queue slot)\r\n");
                    (void)UART_SendOK();
                }
                uint32_t skip_pos = terminator_pos + 1;
                while (skip_pos < nBytesRead && (rxBuffer[skip_pos] == '\r' || rxBuffer[skip_pos] == '\n'))
                    skip_pos++;
                uint32_t remaining_bytes = nBytesRead - skip_pos;
                if (remaining_bytes > 0) {
                    memmove(rxBuffer, &rxBuffer[skip_pos], remaining_bytes);
                    nBytesRead = remaining_bytes;
                    rxBuffer[nBytesRead] = '\0';
                } else {
                    nBytesRead = 0;
                    memset(rxBuffer, 0, sizeof(rxBuffer));
                }
                break;
            }
        }
        /* fall-through */

    case GCODE_STATE_CONTROL_CHAR:
    {
        if (gcodeData.state != GCODE_STATE_CONTROL_CHAR) break;

        uint8_t c = rxBuffer[0];
        if (c == 0x18) {
            GCODE_SoftReset(appData, cmdQueue);
        } else {
            service_realtime_byte(appData, c);
        }

        // ✅ GRBL PROTOCOL: Real-time commands (? ! ~) NEVER generate "ok" responses
        // ✅ Flow control characters (0x95, 0x90, etc.) also don't generate "ok"
        // Consume control character at position 0, plus any trailing CR/LF
        // This prevents "?\r\n" from leaving "\r\n" which would be processed as blank line
        uint32_t skip_pos = 1;  // Skip the control character itself
        while (skip_pos < nBytesRead && (rxBuffer[skip_pos] == '\r' || rxBuffer[skip_pos] == '\n')) {
            skip_pos++;  // Skip all trailing line terminators
        }
        
        if (skip_pos < nBytesRead) {
            // Remaining bytes after control char + terminators
            memmove(rxBuffer, &rxBuffer[skip_pos], nBytesRead - skip_pos);
            nBytesRead -= skip_pos;
            rxBuffer[nBytesRead] = '\0';
            if (nBytesRead > 0 && is_control_char(rxBuffer[0])) {
                gcodeData.state = GCODE_STATE_CONTROL_CHAR;
            } else {
                gcodeData.state = GCODE_STATE_IDLE;
            }
        } else {
            // Nothing left after consuming control char and terminators - clear everything
            nBytesRead = 0;
            rxBuffer[0] = '\0';  // ✅ Ensure first byte is null
            memset(rxBuffer, 0, sizeof(rxBuffer));
            gcodeData.state = GCODE_STATE_IDLE;
        }
        break;
    }

    case GCODE_STATE_QUERY_CHARS:
    {
        const char* cmd = (const char*)rxBuffer;
        size_t len = strlen(cmd);

        bool send_ok = true;
        bool handled = false;

        if (len >= 4 && cmd[0] == '$' && cmd[1] == 'N' && isdigit((unsigned char)cmd[2]) && cmd[3] == '=') {
            int idx = cmd[2] - '0';
            if (idx == 0 || idx == 1) {
                const char* line = &cmd[4];
                size_t l = strlen(line);
                if (l >= GCODE_BUFFER_SIZE) l = GCODE_BUFFER_SIZE - 1;
                size_t w = 0;
                for (size_t i = 0; i < l && w < (GCODE_BUFFER_SIZE - 1); i++) {
                    unsigned char ch = (unsigned char)line[i];
                    if (ch == '\r' || ch == '\n') break;
                    if (ch >= 32 && ch <= 126) startupLines[idx][w++] = (char)ch;
                }
                startupLines[idx][w] = '\0';
                handled = true;
            } else {
                UART3_Write((uint8_t*)"error:4\r\n", 10);
                send_ok = false;
                handled = true;
            }
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == '$') {
            SETTINGS_PrintAll(SETTINGS_GetCurrent());
            handled = true;
            send_ok = false;
        }
        else if (len >= 2 && cmd[0] == '$' && cmd[1] == '#') {
            // GRBL $# command: Report work coordinate systems and offsets
            char buf[400];  // Increased buffer for all WCS data
            int p = 0;
            
            // Report all work coordinate systems (G54-G59)
            for (uint8_t wcs = 0; wcs < 6; wcs++) {
                float x, y, z;
                if (SETTINGS_GetWorkCoordinateSystem(wcs, &x, &y, &z)) {
                    p += snprintf(&buf[p], sizeof(buf)-p, "[G%d:%.3f,%.3f,%.3f]\r\n", 
                                 54 + wcs, x, y, z);
                }
            }
            
            // Report G92 coordinate offset (live value from kinematics, not flash)
            float g92_x, g92_y, g92_z;
            KINEMATICS_GetG92Offset(&g92_x, &g92_y, &g92_z);
            p += snprintf(&buf[p], sizeof(buf)-p, "[G92:%.3f,%.3f,%.3f]\r\n", g92_x, g92_y, g92_z);
            
            // Report live tool length offset (reflects G43, G43.1 and G49)
            bool tlo_active = false;
            float tlo = KINEMATICS_GetTLO(&tlo_active);
            (void)tlo_active;  // active flag available for future use
            p += snprintf(&buf[p], sizeof(buf)-p, "[TLO:%.3f]\r\n", tlo);
            
