Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
                    // Build jog event and submit directly to motion bridge
                    GCODE_Event ev;
                    memset(&ev, 0, sizeof(ev));
                    ev.type                     = GCODE_EVENT_JOG;
                    ev.data.linearMove.x        = tgt_w.coordinate[AXIS_X];
                    ev.data.linearMove.y        = tgt_w.coordinate[AXIS_Y];
                    ev.data.linearMove.z        = tgt_w.coordinate[AXIS_Z];
                    ev.data.linearMove.a        = tgt_w.coordinate[AXIS_A];
                    ev.data.linearMove.feedrate = jf;
                    ev.data.linearMove.isRapid  = false;
                    ev.data.linearMove.is_jog   = true;

                    if (!MOTION_ProcessGcodeEvent(appData, &ev)) {
                        // Trajectory queue full
                        UART3_Write((uint8_t*)"error:8\r\n", 9);
                        send_ok = false;
                    }
                    // send_ok remains true on successful submission
                }
            }
            handled = true;
        }

        if (handled && send_ok) {
            UART_SendOK();
        } else if (!handled) {
            UART3_Write((uint8_t*)"error:4\r\n", 10);
        }

        nBytesRead = 0;
        memset(rxBuffer, 0, sizeof(rxBuffer));
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    case GCODE_STATE_GCODE_COMMAND:
    {
        uint32_t cmd_end = 0;
        for (uint32_t i = 0; i < nBytesRead; i++) {
            if (rxBuffer[i] == '\0') { cmd_end = i; break; }
        }
        DEBUG_PRINT_GCODE("[GCODE_CMD] Processing command: '%s'\r\n", rxBuffer);

        // Inline dispatch: parse every event in this line and try to send each
        // directly to the motion bridge (trajectory).  If the bridge rejects any
        // event (arc active, trajectory full, or motion drain pending) we stay in
        // this state and retry next iteration — rxBuffer is preserved, no ok sent.
        // Back-pressure: UGS gets no ok → stops sending → UART ring fills slowly.
        // This eliminates the arc-to-arc stall: arc2 waits here (1 slot) instead
        // of piling up behind 64 gcode-queue entries while ok credits are already
        // exhausted.
        bool is_probe_cmd = false;
        if (!dispatch_command_line(appData, rxBuffer, cmd_end, &is_probe_cmd)) {
            DEBUG_PRINT_GCODE("[GCODE_CMD] Motion blocked — holding for retry\r\n");
            // Drain real-time control bytes (primarily '?') from the ring ONLY on the
            // first retry iteration (when the pushback slot is empty).  In pipelined
            // mode UGS has already sent the next G-code commands into the ring; each
            // retry consumes one more ring byte and overwrites the pushback slot,
            // destroying the queued G-code data byte-by-byte.  Stopping once the slot
            // is filled guarantees ring integrity from that point on.
            //
            // In single-step mode the ring only contains '?' bytes so this path
            // services them correctly on every retry iteration (the pushback never
            // gets set because no G-code bytes arrive until the ok is sent).
            //
            // '?' bytes that arrive after the pushback is set stay in the ring behind
            // the G-code bytes.  They are processed correctly by GCODE_STATE_IDLE
            // once the arc finishes and arc2 is dispatched.
            if (!s_rxHasPushback) {
                uint8_t rt;
                while (UART3_ReadCountGet() > 0) {
                    if (UART3_Read(&rt, 1) != 1) break;
                    if (rt == 0x18) { GCODE_SoftReset(appData, cmdQueue); return; }
                    if (!is_control_char(rt)) {
                        // First byte of a G-code command — push it back and stop.
                        // All subsequent ring bytes (rest of that command + further
                        // commands) remain intact for GCODE_STATE_IDLE to pick up.
                        s_rxPushback    = rt;
                        s_rxHasPushback = true;
                        break;
                    }
                    service_realtime_byte(appData, rt);
                }
            }
            break;  // stay in GCODE_STATE_GCODE_COMMAND, retry next iteration
        }

        // All events dispatched — send ok (probe commands own their ok via app.c)
        if (!is_probe_cmd) {
            DEBUG_PRINT_GCODE("[GCODE_CMD] Normal flow control\r\n");
            SendOrDeferOk(appData, cmdQueue);
        } else {
            DEBUG_PRINT_GCODE("[GCODE_CMD] Probe command — ok withheld until completion\r\n");
        }

        nBytesRead = 0;
        memset(rxBuffer, 0, sizeof(rxBuffer));
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    case GCODE_STATE_ERROR:
    {
        uint32_t error_len = (uint32_t)sprintf((char*)txBuffer, "error:1\r\n");
        UART3_Write(txBuffer, error_len);
        nBytesRead = 0;
        memset(rxBuffer, 0, sizeof(rxBuffer));
        gcodeData.state = GCODE_STATE_IDLE;
        break;
    }

    default:
        break;
    }
}

/* Optional future advanced parsing disabled */
#if 0
#endif


